class FoodData {
  static Map<String, Map<String, dynamic>> foods = {
    "กระเพราหมูสับ": {
      "price": 35,
      "lat": 18.290431500237492,
      "lng": 99.49833435889327,
      "video": "assets/videos/cook1.mp4",
      "ingredients": ["เนื้อหมู 400 กรัม", "ใบกะเพรา 50 กรัม", "กระเทียม 2 หัว", "พริกแดงจินดา 12 เม็ด"],
      "steps": ["ผัดหมู", "ใส่กระเพรากับวัตถุดิบ", "จัดเสิร์ฟ"],
    },
    "ส้มตำ": {
      "price": 40,
      "lat": 18.29188613294914,  
      "lng": 99.5145802375069,
      "video": "assets/videos/cook2.mp4",
      "ingredients": ["มะละกอขูดฝอย", "พริก", "กระเทียม", "มะเขือเทศ", "น้ำปลา", "น้ำตาลปี๊บ"],
      "steps": ["โขลกพริกและกระเทียมให้ละเอียด", "ใส่มะละกอ มะเขือเทศ น้ำปลา น้ำตาลปี๊บ คลุกให้เข้ากัน", "ชิมรสตามชอบ พร้อมเสิร์ฟ"],
    },
    "ยำวุ้นเส้น": {
      "price": 40,
      "lat": 18.292037521415068,
      "lng": 99.50698933939357,
      "video": "assets/videos/cook3.mp4",
      "ingredients": ["น้ำตาลทราย", "น้ำปลา", "มะนาว", "พริกขี้หนูซอย", "หมูยอ", "วุ้นเส้น", "มะเขือเทศ", "หอมใหญ่"],
      "steps": ["ใส่น้ำลงหม้อ ต้มข่า ตะไคร้ ใบมะกรูด", "ใส่เห็ดและเนื้อสัตว์ ต้มจนสุก", "ใส่มะเขือเทศ หอมใหญ่ แครอทขูดเส้น และ ตั้งโอ๋ ลงไป คนให้เข้าใจตักใส่จานพร้อมเสิร์ฟ"],
    },
    "สลัด": {
      "price": 40,
      "lat": 18.294136205295263,
      "lng": 99.50798224978259,
      "video": "assets/videos/cook4.mp4",
      "ingredients": ["ผักสลัดที่ชอบ เช่น ผักคอส ผักกาด เบบี้ร็อคเก็ต", "ผลไม้ เช่น มะเขือเทศแดง กล้วยหอม 1 ลูก", "เนื้อสัตว์ที่ชอบในปริมาณที่พอเหมาะ เช่น อกไก่ แฮม ปูอัด", "น้ำส้มสายชู , เบกกิ้งโซดา , พริกไทย , เกลือ"],
      "steps": ["นำส่วนผสมทั้งหมดมาคลุกกันและพร้อมกิน"],
    },

    // ของหวาน
    "เค้กช็อกโกแลตฟองดอง": {
      "price": 20,
      "lat": 18.289762814750603,
      "lng": 99.49123295122611,
      "video": "assets/videos/cook5.mp4",
      "ingredients": ["ช็อกโกแลต", "ช็อกโกแลตนมเคลือบน้ำตาล", "ฟองดองไอซิ่ง", "เกล็ดน้ำตาลตามชอบ"],
      "steps": ["ต้มช็อกโกแลตและเทใส่ภาชนะเคลือ 2-3 รอบและเอาแช่เย็นและแกะออกจากแม่พิมพ์"],
    },
    "ถังหูลู่": {
      "price": 30,
      "lat": 18.294982893302585,
      "lng": 99.48196791659831,
      "video": "assets/videos/cook6.mp4",
      "ingredients": ["สตรอเบอร์รี่", "น้ำตาล", "น้ำเปล่า"],
      "steps": ["ต้มน้ำและน้ำตาลรอให้ข้นและนำผลไม้ไปจุ่มรอแข็งพร้อมกิน"],
    },
    "ทองหยอด": {
      "price": 20,
      "lat": 18.29108519376421,
      "lng": 99.50115813756763,
      "video": "assets/videos/cook7.mp4",
      "ingredients": ["ไข่แดงไข่เป็ด", "ไข่แดงไข่ไก่", "แป้งทองหยอด", "น้ำตาลทราย", "น้ำเปล่า"],
      "steps": ["ทำน้ำเชื่อมใส", "แยกไข่แดง", "ตีไข่แดงทั้งสองชนิดให้ขึ้นฟู", "ใส่แป้งทองหยอด","คนให้สุกจนทั่ว ใช้กระชอนตักขึ้น แช่ในน้ำเชื่อมใส"],
    },
  };
}
